#language: ru

Функционал: Добавление и удаление товаров

  @web
  Сценарий: наушники Beats, Samsung

    * выполнена авторизация на сервисе с логином - "comedy.standup.best@gmail.com" и паролем - "123456qwerty"
    * выполнен поиск по "беспроводные наушники"
    * цена ограничена до "10000" руб
    * выбраны бренды "Beats", "Samsung"
    * в корзину добавлены первые 8 "четных" товаров
    * выполнен переход в корзину
    * все добавленные ранее товары находятся в корзине
    * итоговая цена "наушников" равна сумме цен добавленных товаров
    * из корзины удалены все товары
    * выполнен выход из сервиса
    * выполнена авторизация на сервисе с логином - "comedy.standup.best@gmail.com" и паролем - "123456qwerty"
    * выполнен переход в корзину
    * корзина содержит заголовок "Корзина пуста"
